thorrockstar/meta-thornxt-stm/recipes-bsp/trusted-firmware-a/patches/_stm32mp1_ddr.c
	/*
	 *  4. Monitor PHY init status by polling PUBL register PGSR.IDONE
	 *     Perform DDR PHY DRAM initialization and Gate Training Evaluation
	 */
	stm32mp1_ddrphy_idone_wait(priv->phy);

	/*
	 *  5. Indicate to PUBL that controller performs SDRAM initialization
	 *     by setting PIR.INIT and PIR CTLDINIT and pool PGSR.IDONE
	 *     DRAM init is done by PHY, init0.skip_dram.init = 1
	 */

	pir = DDRPHYC_PIR_DLLSRST | DDRPHYC_PIR_DLLLOCK | DDRPHYC_PIR_ZCAL |
	      DDRPHYC_PIR_ITMSRST | DDRPHYC_PIR_DRAMINIT | DDRPHYC_PIR_ICPC;

	if ((config->c_reg.mstr & DDRCTRL_MSTR_DDR3) != 0U) {
		pir |= DDRPHYC_PIR_DRAMRST; /* Only for DDR3 */
	}

	/* Treat self-refresh exit : hot boot */
	if (config->self_refresh) {
		/* DDR in self refresh mode, remove zcal & reset & init */
		pir &= ~(DDRPHYC_PIR_ZCAL & DDRPHYC_PIR_DRAMRST
			 & DDRPHYC_PIR_DRAMINIT);
		pir |= DDRPHYC_PIR_ZCALBYP;
	}

	stm32mp1_ddrphy_init(priv->phy, pir);

	if (config->self_refresh) {
		stm32mp1_self_refresh_zcal(priv, config->zdata);
	}

	/*
	 *  6. SET DFIMISC.dfi_init_complete_en to 1
	 *  Enable quasi-dynamic register programming.
	 */
	stm32mp1_start_sw_done(priv->ctl);

	mmio_setbits_32((uintptr_t)&priv->ctl->dfimisc,
			DDRCTRL_DFIMISC_DFI_INIT_COMPLETE_EN);
	VERBOSE("[0x%lx] dfimisc = 0x%x\n",
		(uintptr_t)&priv->ctl->dfimisc,
		mmio_read_32((uintptr_t)&priv->ctl->dfimisc));

	stm32mp1_wait_sw_done_ack(priv->ctl);

	/*
	 *  7. Wait for DWC_ddr_umctl2 to move to normal operation mode
	 *     by monitoring STAT.operating_mode signal
	 */

	/* Wait uMCTL2 ready */

	/* Trigger self-refresh exit */
	if (config->self_refresh) {
		mmio_clrbits_32((uintptr_t)&priv->ctl->pwrctl,
				DDRCTRL_PWRCTL_SELFREF_SW);
	}

	stm32mp1_wait_operating_mode(priv, DDRCTRL_STAT_OPERATING_MODE_NORMAL);

	/* Switch to DLL OFF mode */
	if ((config->c_reg.mstr & DDRCTRL_MSTR_DLL_OFF_MODE) != 0U) {
		stm32mp1_ddr3_dll_off(priv);
	}

	if (config->p_cal_present) {
		VERBOSE("DDR DQS training skipped.\n");
	} else {
		uint64_t time;

		VERBOSE("DDR DQS training.\n");

		time = timeout_init_us(0);

		/*
		 *  8. Disable Auto refresh and power down by setting
		 *    - RFSHCTL3.dis_au_refresh = 1
		 *    - PWRCTL.powerdown_en = 0
		 *    - DFIMISC.dfiinit_complete_en = 0
		 */
		stm32mp1_refresh_disable(priv->ctl);

		/*
		 *  9. Program PUBL PGCR to enable refresh during training
		 *     and rank to train
		 *     not done => keep the programed value in PGCR
		 */

		/*
		 * 10. configure PUBL PIR register to specify which training
		 *     step to run
		 *     RVTRN is executed only on LPDDR2/LPDDR3
		 */
		pir = DDRPHYC_PIR_QSTRN;
		if ((config->c_reg.mstr & DDRCTRL_MSTR_DDR3) == 0U) {
			pir |= DDRPHYC_PIR_RVTRN;
		}

		stm32mp1_ddrphy_init(priv->phy, pir);

		/* 11. monitor PUB PGSR.IDONE to poll cpmpletion of training
		 *     sequence
		 */
		stm32mp1_ddrphy_idone_wait(priv->phy);

		/* Refresh compensation: forcing refresh command */
		if (config->self_refresh) {
			stm32mp1_refresh_compensation(config, priv->ctl, time);
		}

		/*
		 * 12. set back registers in step 8 to the orginal values
		 *     if desidered
		 */
		stm32mp1_refresh_restore(priv->ctl, config->c_reg.rfshctl3,
					 config->c_reg.pwrctl);
	}

	/* Enable uMCTL2 AXI port 0 */
	mmio_setbits_32((uintptr_t)&priv->ctl->pctrl_0,
			DDRCTRL_PCTRL_N_PORT_EN);
	VERBOSE("[0x%lx] pctrl_0 = 0x%x\n",
		(uintptr_t)&priv->ctl->pctrl_0,
		mmio_read_32((uintptr_t)&priv->ctl->pctrl_0));

#if STM32MP_DDR_DUAL_AXI_PORT
	/* Enable uMCTL2 AXI port 1 */
	mmio_setbits_32((uintptr_t)&priv->ctl->pctrl_1,
			DDRCTRL_PCTRL_N_PORT_EN);
	VERBOSE("[0x%lx] pctrl_1 = 0x%x\n",
		(uintptr_t)&priv->ctl->pctrl_1,
		mmio_read_32((uintptr_t)&priv->ctl->pctrl_1));
#endif
}
